
#ifndef __PCUI_DEPEND_H_
#define __PCUI_DEPEND_H_



/*******************************************************************************
 * 函数名 : PG_Reboot
 * 描  述 : PG重启
 * 参  数 : 无
 * 返  回 : 无
*******************************************************************************/
void PG_Reboot(void);
	

/*******************************************************************************
 * 函数名 : pcui_write_file
 * 描  述 : PG SD卡/emmc 写文件
 * 参  数 : *file_path:文件名称可带路径 比如/sdcard/111/test.txt
			*data_buf:写入内容
			data_size:写入数据大小
			offset:文件偏移大小
 * 返  回 : 1:写入成功
			-1:打开文件失败
			-2:文件写入失败
*******************************************************************************/
int pcui_write_file(char * file_path,void *data_buf, unsigned int data_size,unsigned int offset);
 

/*******************************************************************************
 * 函数名 : pcui_del_file
 * 描  述 : 删除 PG SD卡/emmc 文件
 * 参  数 : *file_path:文件名称可带路径 比如/sdcard/111/test.txt
			
 * 返  回 : 0:删除成功
			-1:删除文件失败
			
*******************************************************************************/
int pcui_del_file(char * file_path);


/*******************************************************************************
 * 函数名 : pcui_open_file
 * 描  述 : 打开文件，可以带路径
 * 参  数 : *file_path:文件名称可带路径 比如/sdcard/111/test.txt
			
 * 返  回 : 1:打开文件成功
			-1:打开文件失败
			-2:文件挂载路径不存在
*******************************************************************************/
int pcui_open_file(char * file_path);


/*******************************************************************************
 * 函数名 : pcui_close_file
 * 描  述 : 关闭上次打开的 PG SD卡/emmc 文件
 * 参  数 : 无
			
 * 返  回 : 0:关闭文件成功
			-1:关闭文件失败		
*******************************************************************************/
int pcui_close_file(void);


/*******************************************************************************
 * 函数名 : pcui_write1_file
 * 描  述 : PG SD卡/emmc 写文件，此函数需要手动打开文件，关闭文件，没有文件偏移
 * 参  数 : *data_buf:写入内容
			data_size:写入数据大小
 * 返  回 : 1:写入成功
			-1:文件写入失败
*******************************************************************************/
int pcui_write1_file(void *data_buf, unsigned int data_size);


#endif


