/********************************* SKYCODE ************************************
* Copyright (c) 2015-2017, 深圳思凯测试技术有限公司
* All rights reserved.
*
* 文件名   ：usart7.h    
* 描述     ：
*
* 版    本 ：V1.0.0
* 作    者 ：
* 完成日期 ：2017-12-29
* 修改描述 ：
*					                          	
******************************************************************************/

#ifndef __USART1_H
#define	__USART1_H

#include "sys.h"
#include <stdio.h>

void USART7_Init(void);


#endif /* __USART1_H */

/******************************* 广州天码电子 *********************************/
