#ifndef __NEW_GAMMA_DEF_H
#define	__NEW_GAMMA_DEF_H

#include <stdint.h>
#include "commonIOInterface.h"

/*镜头切换*/
//#define CA310                             //测试镜头切换，用到那种镜头就定义该镜头就好，另一个屏蔽
//#define CA410                             //测试镜头切换，用到那种镜头就定义该镜头就好，另一个屏蔽
//#define CL2                                 //测试镜头切换，用到那种镜头就定义该镜头就好，另一个屏蔽
#define CL5

#define GammaRegWrite255					//255写函数j参数传255还是传对应绑点数(定义为255写)

#define DEBUG_GAMMA_INFO                   //是否串口打印gamma调试信息（不打印屏蔽该宏定义即可）

#define DEBUG_GAMMA_LOG                    //是否打印调试日志(不打印屏蔽该宏定义即可)
#define LOG_FILENAME        "21XXXLOG.csv" //打印本项目Gamma调试日志存放文件名命名(*不超过64字符)

typedef struct
{
	//某一阶的 目标亮度与色坐标
	uint8_t level;  	//当前绑点是多少阶	
	uint8_t readD;  	//读镜头次数做延时用
	uint8_t readN;  	//读镜头次数做平均
    uint16_t delay;		//延时ms
  
  
	float targetX;  		//每一阶目标X 	eg.3.0
	float targetY; 			//每一阶目标Y		eg.3.1
  
  
	//卡控
	float dGamma; 	//每阶dGamma
	float dLv; 	  	//每阶dLv
	float dxy;	  	//每阶dxy
	float De; 		//每阶的色准误差
	
	//计算的值
	float targetLv;  		//每一阶目标亮度
	float targetlvMax;		//每一阶目标误差最大亮度
	float targetlvMin; 		//每一阶目标误差最小亮度		
	int tuningN;     		//这一阶最多调多少次
	double measureXYLv[3];  //测量的到的x y lv顺序也为这个
}
NEW_OneOrderGammaConfigStruct;
	
typedef struct
{
	char displaymode[64];	//绑定当前模式标识（字符串类型）："Idle"、"Normal"、"HBM"
	int Order;   			//有多少个绑点(包含0)
	int num; 				//当前是多少阶	
	int ci; 				//表示此时再调某一阶的第几次
	int maxlv ;				//255阶的目标亮度
	
	float gamma;			//	eg.2.2
//	float targetX;  		//每一阶目标X 	eg.3.0
//	float targetY; 			//每一阶目标Y		eg.3.1
	
    int RGB_MAX;//eg.1023
    int RGB_MIN;//eg.0
	
	unsigned short gammaDefReg[255]; //按照顺序排列  初始化后不改变
	unsigned short gammaSetReg[255]; //计算结果保存的位置
	unsigned short gammaMetReg[255]; //计算结果保存的位置
	
    unsigned short gammaMax[3];
	 
	NEW_OneOrderGammaConfigStruct OGammaConfig[64]; //最多能保存64阶gamma配置  0表示第0个绑点

	float * nndate;
	int (*gammaRegWrite)(int j, uint16_t *data);				//函数指针 设置第255阶的绑点的函数， 输入为三个u16类型的寄存器值
	int (*gammaRegWriteAll)(uint16_t *data);					//函数指针 设置寄存器值  (需要初始化什么的的要实现，指针为0 代表全部设0)
	int (*readLv)(uint8_t n, double xyz[3], double xyLv[3]);	//读取亮度与色坐标 n为读取几次求均值
}
NEW_GammaConfigStruct;





/**********************************************/
/****以下需要多少组模式调gamma就配置多少组参数****/
/**********************************************/

/*====================================

		IDLE

======================================*/
//注意一定要加F
#define IDLE_DEF_GAMMA_TARGET_GAMMA  2.2F
#define IDLE_DEF_GAMMA_TARGET_MAX_LV 120.0F 
#define IDLE_DEF_GAMMA_TARGET_X 0.30F 			
#define IDLE_DEF_GAMMA_TARGET_Y 0.315F 


#define IDLE_DEF_GAMMA_ORDER_NUM  27
#define IDLE_CAL0_ORDER 0

#define IDLE_DEF_GAMMA_LEVEL {0,1,3,7,11,15,19,23,27,31,35,39,47,55,63,79,95,111,127,143,159,175,191,207,223,239,255}
	
#define IDLE_DEF_GAMMA_REG_ADRR  {	0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,0x08,0x09,0x0A,0x0B,0x0C,0x0D,0x0E,0x0F,\
									0x10,0x11,0x12,0x13,0x14,0x15,0x16,0x17,0x18,0x19,0x1A,0x1B,0x1C,0x1D,0x1E,0x1F,\
									0x20,0x21,0x22,0x23,0x24,0x25,0x26,0x27,0x28,0x29,0x2A,0x2B,0x2C,0x2D,0x2E,0x2F,\
									0x30,0x31,0x32,0x33,0x34,0x35,0x36,0x37,0x38,0x39,0x3A,0x3B,0x3C,0x3D,0x3E,0x3F,\
									0x40,0x41,0x42,0x43,0x44,0x45,0x46,0x47,0x48,0x49,0x4A,0x4B,0x4C,0x4D,0x4E,0x4F,\
									0x50,0x51,0x52,0x53,0x54,0x55,0x56,0x57,0x58,0x59,0x5A,0x5B,0x5C,0x5D,0x5E,0x5F,\
									0x60,0x61,0x62,0x63,0x64,0x65,0x66,0x67,0x68,0x69,0x6A,0x6B,0x6C,0x6D,0x6E,0x6F,\
									0x70,0x71,0x72,0x73,0x74,0x75,0x76,0x77,0x78,0x79,0x7A,0x7B,0x7C,0x7D,0x7E,0x7F,\
									0x80,0x81,0x82,0x83,0x84,0x85,0x86,0x87,0x88,0x89,0x8A,0x8B,0x8C,0x8D,0x8E,0x8F,\
									0x90,0x91,0x92,0x93,0x94,0x95,0x96,0x97,0x98,0x99,0x9A,0x9B,0x9C,0x9D,0x9E,0x9F,\
									0xA0,0xA1}
																	 

#define IDLE_DEF_GAMMA_RGB_REG   {	0,127,128,159,253,317,355,388,418,442,466,486,520,551,579,629,672,710,745,776,805,832,856,883,907,930,951,\
0,209,210,241,284,327,360,388,418,441,466,486,522,554,584,634,677,715,750,781,812,839,866,891,914,936,960,\
0,285,286,317,367,414,450,482,512,539,562,584,621,656,687,738,784,826,862,896,927,957,986,1014,1039,1063,1088,}



/*====================================

		HBM

======================================*/
//注意一定要加F
#define HBM_DEF_GAMMA_TARGET_GAMMA  2.2F
#define HBM_DEF_GAMMA_TARGET_MAX_LV 1200.0F 
#define HBM_DEF_GAMMA_TARGET_X 0.3F 			
#define HBM_DEF_GAMMA_TARGET_Y 0.315F 


#define HBM_DEF_GAMMA_ORDER_NUM  27
#define HBM_CAL0_ORDER 0

#define HBM_DEF_GAMMA_LEVEL {0,1,3,7,11,15,19,23,27,31,35,39,47,55,63,79,95,111,127,143,159,175,191,207,223,239,255}
	
#define HBM_DEF_GAMMA_REG_ADRR  {	0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,0x08,0x09,0x0A,0x0B,0x0C,0x0D,0x0E,0x0F,\
									0x10,0x11,0x12,0x13,0x14,0x15,0x16,0x17,0x18,0x19,0x1A,0x1B,0x1C,0x1D,0x1E,0x1F,\
									0x20,0x21,0x22,0x23,0x24,0x25,0x26,0x27,0x28,0x29,0x2A,0x2B,0x2C,0x2D,0x2E,0x2F,\
									0x30,0x31,0x32,0x33,0x34,0x35,0x36,0x37,0x38,0x39,0x3A,0x3B,0x3C,0x3D,0x3E,0x3F,\
									0x40,0x41,0x42,0x43,0x44,0x45,0x46,0x47,0x48,0x49,0x4A,0x4B,0x4C,0x4D,0x4E,0x4F,\
									0x50,0x51,0x52,0x53,0x54,0x55,0x56,0x57,0x58,0x59,0x5A,0x5B,0x5C,0x5D,0x5E,0x5F,\
									0x60,0x61,0x62,0x63,0x64,0x65,0x66,0x67,0x68,0x69,0x6A,0x6B,0x6C,0x6D,0x6E,0x6F,\
									0x70,0x71,0x72,0x73,0x74,0x75,0x76,0x77,0x78,0x79,0x7A,0x7B,0x7C,0x7D,0x7E,0x7F,\
									0x80,0x81,0x82,0x83,0x84,0x85,0x86,0x87,0x88,0x89,0x8A,0x8B,0x8C,0x8D,0x8E,0x8F,\
									0x90,0x91,0x92,0x93,0x94,0x95,0x96,0x97,0x98,0x99,0x9A,0x9B,0x9C,0x9D,0x9E,0x9F,\
									0xA0,0xA1}
																	 

#define HBM_DEF_GAMMA_RGB_REG  {	0,272,273,382,452,503,549,586,619,649,675,701,745,786,826,892,952,1007,1060,1113,1163,1211,1259,1306,1352,1398,1443,\
0,345,346,402,461,510,555,591,624,655,680,707,752,793,833,900,960,1017,1071,1121,1171,1219,1267,1313,1358,1405,1452,\
0,373,374,466,538,594,643,683,719,751,780,808,858,904,945,1020,1086,1149,1211,1269,1325,1380,1436,1489,1542,1593,1644,}	



/*====================================

		Normal 1

======================================*/
//注意一定要加F
#define NORMAL_DEF_GAMMA_TARGET_GAMMA  2.2F
#define NORMAL_DEF_GAMMA_TARGET_MAX_LV 600.0F 
#define NORMAL_DEF_GAMMA_TARGET_X 0.30F 			
#define NORMAL_DEF_GAMMA_TARGET_Y 0.315F 


#define NORMAL_DEF_GAMMA_ORDER_NUM  27
#define NORMAL_CAL0_ORDER 0

#define NORMAL_DEF_GAMMA_LEVEL     {0,1,3,7,11,15,19,23,27,31,35,39,47,55,63,79,95,111,127,143,159,175,191,207,223,239,255}

	//SH8501A 此地址应该用不到
#define NORMAL_DEF_GAMMA_REG_ADRR  {0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,0x08,0x09,0x0A,0x0B,0x0C,0x0D,0x0E,0x0F,\
									0x10,0x11,0x12,0x13,0x14,0x15,0x16,0x17,0x18,0x19,0x1A,0x1B,0x1C,0x1D,0x1E,0x1F,\
									0x20,0x21,0x22,0x23,0x24,0x25,0x26,0x27,0x28,0x29,0x2A,0x2B,0x2C,0x2D,0x2E,0x2F,\
									0x30,0x31,0x32,0x33,0x34,0x35,0x36,0x37,0x38,0x39,0x3A,0x3B,0x3C,0x3D,0x3E,0x3F,\
									0x40,0x41,0x42,0x43,0x44,0x45,0x46,0x47,0x48,0x49,0x4A,0x4B,0x4C,0x4D,0x4E,0x4F,\
									0x50,0x51,0x52,0x53,0x54,0x55,0x56,0x57,0x58,0x59,0x5A,0x5B,0x5C,0x5D,0x5E,0x5F,\
									0x60,0x61,0x62,0x63,0x64,0x65,0x66,0x67,0x68,0x69,0x6A,0x6B,0x6C,0x6D,0x6E,0x6F,\
									0x70,0x71,0x72,0x73,0x74,0x75,0x76,0x77,0x78,0x79,0x7A,0x7B,0x7C,0x7D,0x7E,0x7F,\
									0x80,0x81,0x82,0x83,0x84,0x85,0x86,0x87,0x88,0x89,0x8A,0x8B,0x8C,0x8D,0x8E,0x8F,\
									0x90,0x91,0x92,0x93,0x94,0x95,0x96,0x97,0x98,0x99,0x9A,0x9B,0x9C,0x9D,0x9E,0x9F,\
									0xA0,0xA1}

//																					 
#define NORMAL_DEF_GAMMA_RGB_REG	{	0,248,249,343,407,457,498,532,563,591,617,639,681,719,752,812,867,915,961,1003,1044,1083,1120,1158,1194,1231,1268,\
0,341,342,379,422,466,504,537,567,595,621,644,686,723,757,818,873,922,968,1011,1053,1092,1130,1167,1204,1240,1276,\
0,362,363,430,492,545,589,626,659,689,717,741,787,829,866,931,992,1046,1096,1145,1193,1238,1282,1324,1367,1410,1453,\
									}		




/*====================================

		Normal 3

======================================*/
//注意一定要加F
#define NOR3_DEF_GAMMA_TARGET_GAMMA  2.2F
#define NOR3_DEF_GAMMA_TARGET_MAX_LV 2286.0F 
#define NOR3_DEF_GAMMA_TARGET_X 0.3F 			
#define NOR3_DEF_GAMMA_TARGET_Y 0.315F 


#define NOR3_DEF_GAMMA_ORDER_NUM  2
#define NOR3_CAL0_ORDER 0

#define NOR3_DEF_GAMMA_LEVEL     {0,255}

#define NOR3_DEF_GAMMA_REG_ADRR  {0xac,0xad,0xb2,0xb3,0xb8,0xb9}

																		 
																		 
#define NOR3_DEF_GAMMA_RGB_REG {0,587,\
																0,598,\
															  0,710} 


/*====================================

		Normal 4

======================================*/
//注意一定要加F
#define NOR4_DEF_GAMMA_TARGET_GAMMA  2.2F
#define NOR4_DEF_GAMMA_TARGET_MAX_LV 2920.0F 
#define NOR4_DEF_GAMMA_TARGET_X 0.3F 			
#define NOR4_DEF_GAMMA_TARGET_Y 0.315F 


#define NOR4_DEF_GAMMA_ORDER_NUM  2
#define NOR4_CAL0_ORDER 0

#define NOR4_DEF_GAMMA_LEVEL     {0,255}

#define NOR4_DEF_GAMMA_REG_ADRR  {0xae,0xaf,0xb4,0xb5,0xba,0xbb}

																		 
																		 
#define NOR4_DEF_GAMMA_RGB_REG {0,587,\
																0,598,\
															  0,710} 

/*====================================

		Normal 2

======================================*/
//注意一定要加F
#define NOR2_DEF_GAMMA_TARGET_GAMMA  2.2F
#define NOR2_DEF_GAMMA_TARGET_MAX_LV 60.0F   
#define NOR2_DEF_GAMMA_TARGET_X 0.30F 			
#define NOR2_DEF_GAMMA_TARGET_Y 0.315F 


#define NOR2_DEF_GAMMA_ORDER_NUM  27
#define NOR2_CAL0_ORDER 0

#define NOR2_DEF_GAMMA_LEVEL     {0,1,3,7,11,15,19,23,27,31,35,39,47,55,63,79,95,111,127,143,159,175,191,207,223,239,255}
	
#define NORMAL2_DEF_GAMMA_REG_ADRR  { 0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,0x08,0x09,0x0A,0x0B,0x0C,0x0D,0x0E,0x0F,\
																			0x10,0x11,0x12,0x13,0x14,0x15,0x16,0x17,0x18,0x19,0x1A,0x1B,0x1C,0x1D,0x1E,0x1F,\
																			0x20,0x21,0x22,0x23,0x24,0x25,0x26,0x27,0x28,0x29,0x2A,0x2B,     0x2D,     0x2F,\
																			0x30,0x31,0x32,0x33,0x34,0x35,0x36,0x37,0x38,0x39,0x3A,0x3B,     0x3D,     0x3F,\
																			0x40,0x41,0x42,0x43,0x44,0x45,0x46,0x47,0x48,0x49,0x4A,0x4B,0x4C,0x4D,0x4E,0x4F,\
																			0x50,     0x52,0x53,0x54,0x55,0x56,0x57,0x58,0x59,0x5A,0x5B,0x5C,0x5D,0x5E,0x5F,\
																			0x60,0x61,0x62,0x63,0x64,0x65,0x66,0x67,0x68,0x69,0x6A,0x6B,0x6C,0x6D,0x6E,0x6F,\
																			0x70,0x71,0x72,0x73,0x74,0x75,0x76,0x77,0x78,0x79,0x7A,0x7B,0x7C,0x7D,0x7E,0x7F,\
																			0x80,0x81,0x82,0x83,0x84,0x85,0x86,0x87,0x88,0x89,0x8A,0x8B,0x8C,0x8D,0x8E,0x8F,\
																			0x90,0x91,0x92,0x93,0x94,0x95,0x96,0x97,0x98,0x99,0x9A,0x9B,0x9C,0x9D,0x9E,0x9F,\
																			0xA0,     0xA2,0xA3,0xA4,0xA5,0xA6,0xA7}

																		 
//#define NORMAL2_DEF_GAMMA_RGB_REG	{	0,206,207,238,265,288,309,323,342,352,362,372,392,408,422,449,471,493,513,530,548,564,579,593,607,621,636,\
										0,261,262,280,291,306,320,334,350,360,369,380,400,416,430,459,483,505,526,544,562,578,593,609,623,637,652,\
										0,284,285,316,334,355,373,389,408,419,430,442,465,482,500,531,559,584,608,629,650,670,687,705,723,740,757,}  //hyk 241122 120nits
	
#define NORMAL2_DEF_GAMMA_RGB_REG	{0,295,296,297,298,299,307,319,335,349,370,390,418,439,458,490,515,539,561,579,597,612,629,645,658,671,684,\
0,393,394,395,396,397,405,417,420,424,432,437,452,466,480,506,529,551,572,590,608,623,638,653,666,679,691,\
0,437,438,439,440,441,449,461,465,471,481,489,508,526,542,572,598,622,644,663,684,699,716,732,745,758,771}
	
//	0,252,253,254,255,256,263,275,277,292,310,324,346,363,380,407,431,451,468,484,502,516,529,542,555,566,575,\
//0,318,319,320,321,322,329,341,342,345,352,357,369,381,393,416,435,454,472,488,503,517,530,543,555,566,578,\
//0,355,356,357,358,359,366,378,379,385,392,401,417,431,446,471,494,514,534,550,568,582,596,608,623,634,644,}
	
//	0,220,221,222,223,224,230,239,245,257,275,288,311,328,345,371,394,415,432,449,463,476,489,502,514,524,535,\
//0,296,297,298,299,300,306,316,317,322,328,332,344,356,368,389,409,429,445,462,476,490,503,516,528,538,550,\
//0,331,332,333,334,335,341,352,354,361,370,377,394,409,424,449,473,495,513,532,546,562,576,590,604,617,626,} //250623 10nit
	
//	0,289,290,291,292,293,299,309,310,323,337,351,372,387,401,428,448,465,486,501,515,528,541,553,565,576,585,\
//0,348,349,350,351,352,358,368,369,374,377,385,395,406,419,439,458,476,494,509,523,536,549,561,573,583,594,\
//0,382,383,384,385,386,392,402,404,410,418,427,442,455,470,494,517,535,556,571,586,602,615,627,639,649,662,} //250621 10nit
	
//	0,133,134,135,136,137,143,149,197,217,239,252,279,297,314,341,362,383,400,416,430,443,455,468,479,489,509,\
//																	0,261,262,263,264,265,271,277,281,287,292,297,310,323,335,355,376,394,411,428,442,456,469,480,491,503,520,\
//																	0,299,300,301,302,303,309,315,323,329,336,344,359,374,385,410,433,452,470,487,501,516,530,542,555,566,584}  //20250221 120nit
	
//	0,232,233,234,235,269,297,315,333,346,359,369,390,409,428,457,483,506,527,545,564,582,599,615,630,644,660,\
//																	0,284,285,286,287,302,318,332,345,358,370,381,402,422,439,470,497,521,544,565,584,603,620,637,653,669,685,\
//																	0,332,333,334,335,353,371,386,402,416,430,441,465,488,508,542,574,601,627,651,673,695,715,735,753,772,791}
//	0,402,403,404,405,406,414,422,431,439,450,458,475,489,504,527,547,566,583,599,614,627,640,655,667,679,689,
//0,448,449,450,451,452,456,459,464,468,473,478,488,499,509,532,551,569,586,602,617,631,645,658,670,682,693,
//0,469,470,471,472,473,481,488,497,506,513,521,538,553,568,595,620,642,662,683,699,717,732,750,763,775,789,  //第二次
//	0,204,205,206,224,245,265,281,300,312,328,341,365,385,405,438,465,491,514,534,555,573,590,607,623,639,654,\
//0,235,236,237,251,266,283,299,316,328,341,353,376,395,415,447,475,500,523,544,565,583,600,617,633,649,665,\
//0,268,269,270,294,318,341,360,379,393,409,423,448,470,492,527,557,584,610,632,655,675,695,714,731,749,766,}  //24.12.9 xqc 120nit
	
#endif


